print("Вітаємо в грі 'Пошук скарбів'!")
    print("Ти знаходишся в темній печері. Перед тобою три шляхи.")
    print(" Шлях 1: Може принести тобі багатство.")
    print(" Шлях 2: Приведе до виходу.")
    print(" Шлях 3: Може виявитися небезпечним.")
    
    # Запитуємо вибір гравця
    choice = input("Обери свій шлях (1, 2 або 3): ")
    
    if choice == "1":
        print("Ти обрав Шлях 1.")
        print("Вітаємо! Ти знайшов величезний коштовний камінь. Тепер ти багатий!")
    elif choice == "2":
        print("Ти обрав Шлях 2.")
        print("Тобі вдалося знайти вихід із печери. Ти вільний!")
    elif choice == "3":
        print("Ти обрав Шлях 3.")
        print("О ні! Ти потрапив у заплутаний лабіринт. Знайти вихід буде непросто.")
    else:
        print("Неправильний вибір. Спробуй знову та обери 1, 2 або 3.")
